# GetProjectGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPath..::..GetProjectGUID Method
ModelPath Class See Also
---
A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Guid GetProjectGUID()
```

Visual Basic
---
```text
Public Function GetProjectGUID As Guid
```

Visual C++
---
```text
public:
Guid GetProjectGUID()
```

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace